In [1]:
import numpy as np
import pandas as pd

In [4]:
np.random.seed(1)  #값을 통일하게 만들기 위해 seed설정
dic={'X1':np.random.normal(0,1,5),
     'X2':np.random.normal(0,1,5),
     'X3':np.random.normal(0,1,5),
     'X4':np.random.normal(0,1,5),
     'X5':np.random.normal(0,1,5),
     'X6':np.random.normal(0,1,5)}
df1=pd.DataFrame(dic)
df1

         X1        X2        X3        X4        X5        X6
0  1.624345 -2.301539  1.462108 -1.099891 -1.100619 -0.683728
1 -0.611756  1.744812 -2.060141 -0.172428  1.144724 -0.122890
2 -0.528172 -0.761207 -0.322417 -0.877858  0.901591 -0.935769
3 -1.072969  0.319039 -0.384054  0.042214  0.502494 -0.267888
4  0.865408 -0.249370  1.133769  0.582815  0.900856  0.530355

### 첫번째 행을 선택해보자

In [5]:
df1.iloc[0]

X1    1.624345
X2   -2.301539
X3    1.462108
X4   -1.099891
X5   -1.100619
X6   -0.683728
Name: 0, dtype: float64

In [7]:
df1.iloc[[0]]  #이게 더 보기 좋음

         X1        X2        X3        X4        X5        X6
0  1.624345 -2.301539  1.462108 -1.099891 -1.100619 -0.683728

In [9]:
df1.iloc[0,1] # 오 어쩌다가 걍 나옴 이렇게 하면 0번째 행 1번쨰 열 나옴

-2.3015386968802827

In [11]:
df1.iloc[0,:]  #행을 뽑기

X1    1.624345
X2   -2.301539
X3    1.462108
X4   -1.099891
X5   -1.100619
X6   -0.683728
Name: 0, dtype: float64

In [14]:
df1.iloc[[0],:]   #괄호 헷갈림....

         X1        X2        X3        X4        X5        X6
0  1.624345 -2.301539  1.462108 -1.099891 -1.100619 -0.683728

### loc으로 해보장

In [15]:
df1.loc[0]

X1    1.624345
X2   -2.301539
X3    1.462108
X4   -1.099891
X5   -1.100619
X6   -0.683728
Name: 0, dtype: float64

In [16]:
df1.loc[[0]]

         X1        X2        X3        X4        X5        X6
0  1.624345 -2.301539  1.462108 -1.099891 -1.100619 -0.683728

In [17]:
df1.loc[0,:]

X1    1.624345
X2   -2.301539
X3    1.462108
X4   -1.099891
X5   -1.100619
X6   -0.683728
Name: 0, dtype: float64

In [18]:
df1.loc[[0],:]

         X1        X2        X3        X4        X5        X6
0  1.624345 -2.301539  1.462108 -1.099891 -1.100619 -0.683728

### 다시 iloc

In [21]:
df1.iloc[[True,True,False,False,False]]    #첫번째, 두번째 행을 뽑아라...를 True 로 나타냄

         X1        X2        X3        X4        X5        X6
0  1.624345 -2.301539  1.462108 -1.099891 -1.100619 -0.683728
1 -0.611756  1.744812 -2.060141 -0.172428  1.144724 -0.122890

In [22]:
df1.iloc[[False,False,True,True,False],:] #이렇게 해도 가능

         X1        X2        X3        X4        X5        X6
2 -0.528172 -0.761207 -0.322417 -0.877858  0.901591 -0.935769
3 -1.072969  0.319039 -0.384054  0.042214  0.502494 -0.267888

In [24]:
df1.loc[[False,False,True,False,True]]  #loc으로 해도 가능

         X1        X2        X3        X4        X5        X6
2 -0.528172 -0.761207 -0.322417 -0.877858  0.901591 -0.935769
4  0.865408 -0.249370  1.133769  0.582815  0.900856  0.530355

In [27]:
df1.loc[[False,False,True,False,True],:]  #당연히 이것도 가능

         X1        X2        X3        X4        X5        X6
2 -0.528172 -0.761207 -0.322417 -0.877858  0.901591 -0.935769
4  0.865408 -0.249370  1.133769  0.582815  0.900856  0.530355

In [28]:
df1

         X1        X2        X3        X4        X5        X6
0  1.624345 -2.301539  1.462108 -1.099891 -1.100619 -0.683728
1 -0.611756  1.744812 -2.060141 -0.172428  1.144724 -0.122890
2 -0.528172 -0.761207 -0.322417 -0.877858  0.901591 -0.935769
3 -1.072969  0.319039 -0.384054  0.042214  0.502494 -0.267888
4  0.865408 -0.249370  1.133769  0.582815  0.900856  0.530355

### 1,3행 선택해보장

In [29]:
df1.iloc[[0,2],:]

         X1        X2        X3        X4        X5        X6
0  1.624345 -2.301539  1.462108 -1.099891 -1.100619 -0.683728
2 -0.528172 -0.761207 -0.322417 -0.877858  0.901591 -0.935769

In [30]:
df1.iloc[[0,2]]

         X1        X2        X3        X4        X5        X6
0  1.624345 -2.301539  1.462108 -1.099891 -1.100619 -0.683728
2 -0.528172 -0.761207 -0.322417 -0.877858  0.901591 -0.935769

In [31]:
df1.loc[[0,2]]

         X1        X2        X3        X4        X5        X6
0  1.624345 -2.301539  1.462108 -1.099891 -1.100619 -0.683728
2 -0.528172 -0.761207 -0.322417 -0.877858  0.901591 -0.935769

### loc vs iloc

인덱스가 정수가 아닌경우

In [33]:
_df=pd.DataFrame({'A':[1,2,3,4],'B':[4,5,6,7]},index=list('abcd')) #괄호가 항상헷갈림...

In [34]:
_df

   A  B
a  1  4
b  2  5
c  3  6
d  4  7

In [36]:
_df.loc['a']

A    1
B    4
Name: a, dtype: int64

In [42]:
_df.loc['a':'c',] #문자니까 loc사용

   A  B
a  1  4
b  2  5
c  3  6

In [44]:
_df.iloc[0:2,]

   A  B
a  1  4
b  2  5

### 요약 : loc보다는 iloc이 더 쓸모있다~~

but 특정경우에 loc이 더 쓸모있을때 있음
시계열 자료일때

In [45]:
_df

   A  B
a  1  4
b  2  5
c  3  6
d  4  7

A열 뽑을땐!!

_df.loc['A']  ###이거안됨

In [48]:
_df['A']

a    1
b    2
c    3
d    4
Name: A, dtype: int64

iloc과 loc 은 [2],[2,:]처럼 1차원으로 원소 인덱싱,, 아님 [2,3],[:,3]와 같이 2차원으로 인덱싱
1차원 인덱싱하는 경우 기본적으로 행을 인덱싱,,

### iloc,loc 은 행이 열보다 더 친하다!!

---

In [55]:
np.random.seed(1) #값 고정
df2=pd.DataFrame(np.random.normal(size=(10,4)),columns=list('ABCD'))

In [56]:
df2

          A         B         C         D
0  1.624345 -0.611756 -0.528172 -1.072969
1  0.865408 -2.301539  1.744812 -0.761207
2  0.319039 -0.249370  1.462108 -2.060141
3 -0.322417 -0.384054  1.133769 -1.099891
4 -0.172428 -0.877858  0.042214  0.582815
5 -1.100619  1.144724  0.901591  0.502494
6  0.900856 -0.683728 -0.122890 -0.935769
7 -0.267888  0.530355 -0.691661 -0.396754
8 -0.687173 -0.845206 -0.671246 -0.012665
9 -1.117310  0.234416  1.659802  0.742044

칼럼A의 값이 0보다 큰 경우만

In [58]:
df2.loc[map(lambda x: x>0,df2['A']),:] #map 과 lambda사용  df2의`A`의 값 중에 0보다 큰 행을 뽑아라

          A         B         C         D
0  1.624345 -0.611756 -0.528172 -1.072969
1  0.865408 -2.301539  1.744812 -0.761207
2  0.319039 -0.249370  1.462108 -2.060141
6  0.900856 -0.683728 -0.122890 -0.935769

In [62]:
df2.loc[lambda df2: df2['A']>0,:] #map사용 없이 할 수  있음 함수를 적용한게 아니라 오브젝트 자체를 함

          A         B         C         D
0  1.624345 -0.611756 -0.528172 -1.072969
1  0.865408 -2.301539  1.744812 -0.761207
2  0.319039 -0.249370  1.462108 -2.060141
6  0.900856 -0.683728 -0.122890 -0.935769

df2로 써도 되고 그냥 df 로 써도 된다... 어케 그러지..?

In [65]:
df2.loc[lambda df2 : df2['C']>0,:]

          A         B         C         D
1  0.865408 -2.301539  1.744812 -0.761207
2  0.319039 -0.249370  1.462108 -2.060141
3 -0.322417 -0.384054  1.133769 -1.099891
4 -0.172428 -0.877858  0.042214  0.582815
5 -1.100619  1.144724  0.901591  0.502494
9 -1.117310  0.234416  1.659802  0.742044

칼럼 A>0, 칼럼 C<0인 경우

In [67]:
df2.loc[map(lambda x,y: x>0 and y<0,df2['A'],df2['C']),:]  #lambda 입력:출력

          A         B         C         D
0  1.624345 -0.611756 -0.528172 -1.072969
6  0.900856 -0.683728 -0.122890 -0.935769

In [69]:
df2.loc[map(lambda x,y:(x>0) & (y<0), df2['A'],df2['C'])]  #&이거 쓸때는 걍 (x>0) & (y<0)이렇게 괄호 쳐주면ㄷ 됨

          A         B         C         D
0  1.624345 -0.611756 -0.528172 -1.072969
6  0.900856 -0.683728 -0.122890 -0.935769

In [70]:
df2

          A         B         C         D
0  1.624345 -0.611756 -0.528172 -1.072969
1  0.865408 -2.301539  1.744812 -0.761207
2  0.319039 -0.249370  1.462108 -2.060141
3 -0.322417 -0.384054  1.133769 -1.099891
4 -0.172428 -0.877858  0.042214  0.582815
5 -1.100619  1.144724  0.901591  0.502494
6  0.900856 -0.683728 -0.122890 -0.935769
7 -0.267888  0.530355 -0.691661 -0.396754
8 -0.687173 -0.845206 -0.671246 -0.012665
9 -1.117310  0.234416  1.659802  0.742044

In [76]:
df2.loc[map(lambda x,y : x>-1 and y<1.5,df2['A'],df2['C']),:]

          A         B         C         D
0  1.624345 -0.611756 -0.528172 -1.072969
2  0.319039 -0.249370  1.462108 -2.060141
3 -0.322417 -0.384054  1.133769 -1.099891
4 -0.172428 -0.877858  0.042214  0.582815
6  0.900856 -0.683728 -0.122890 -0.935769
7 -0.267888  0.530355 -0.691661 -0.396754
8 -0.687173 -0.845206 -0.671246 -0.012665